_Rarzrabotki/Kazna/AccumulationRegisters/БДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>БДДС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПриход</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасход</Name>
					<Comment>Сумма в валюте банковского счета (кассы)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтараяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаФОТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалогов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПланФакт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Секции</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/НаправленияДвиженийДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>НаправленияДвиженийДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыДенежныхСредств</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыОперацийПКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеСРасчетногоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПодотчетником</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходДенежныхСредствПрочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыОперацийПоступлениеБезналичныхДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеБезналичныхДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступлениеБезналичныхДенежныхСредств</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/БДДС/Ext/RecordSetModule.bsl
Процедура ВыполнитьДвижениеОбщая(Объект, ВидОплаты, ЭтоРасход, Сторнировать, ПланФакт, БратьИзЗаявки)
	
	МетаданныеОбъекта = Объект.Метаданные();
	НоваяСтрока = Добавить();
	
	Если МетаданныеОбъекта.Реквизиты.Найти("ДатаОплаты")<>Неопределено
		И ЗначениеЗаполнено(Объект.ДатаОплаты) Тогда
		НоваяСтрока.Период = Объект.ДатаОплаты;
	Иначе
		НоваяСтрока.Период = Объект.Дата;
	КонецЕсли;
	Если МетаданныеОбъекта.Реквизиты.Найти("Подразделение")<>Неопределено Тогда
		НоваяСтрока.Подразделение = Объект.Подразделение;
	КонецЕсли;
	Если МетаданныеОбъекта.Реквизиты.Найти("Секция")<>Неопределено Тогда
		НоваяСтрока.Секция = Объект.Секция;
	КонецЕсли;
	Если МетаданныеОбъекта.Реквизиты.Найти("Этаж")<>Неопределено Тогда
		НоваяСтрока.Этаж = Объект.Этаж;
	КонецЕсли;
	
	Если МетаданныеОбъекта.Реквизиты.Найти("ДокументОснование")<>Неопределено Тогда
		НоваяСтрока.ДокументОснование = Объект.ДокументОснование;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(НоваяСтрока.Направление)
		И ЗначениеЗаполнено(НоваяСтрока.ДокументОснование)
		И НоваяСтрока.ДокументОснование.Метаданные().Реквизиты.Найти("СчетНаОплатуПоставщика")<>Неопределено Тогда
		НоваяСтрока.Направление = НоваяСтрока.ДокументОснование.СчетНаОплатуПоставщика.Направление;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоваяСтрока.Направление) ТОГДА
		Если МетаданныеОбъекта.Реквизиты.Найти("Направление")<>Неопределено Тогда
			НоваяСтрока.Направление = Объект.Направление;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоваяСтрока.Этаж)
		И ЗначениеЗаполнено(НоваяСтрока.ДокументОснование)
		И НоваяСтрока.ДокументОснование.Метаданные().Реквизиты.Найти("СчетНаОплатуПоставщика")<>Неопределено Тогда
		НоваяСтрока.Этаж = НоваяСтрока.ДокументОснование.СчетНаОплатуПоставщика.Этаж;
	КонецЕсли;
	
	Если МетаданныеОбъекта.Реквизиты.Найти("СтатьяДвиженияДенежныхСредств")<>Неопределено Тогда
		НоваяСтрока.СтатьяДвиженияДенежныхСредств = Объект.СтатьяДвиженияДенежныхСредств;
	КонецЕсли;
	
	Если БратьИзЗаявки
		И ТипЗнч(НоваяСтрока.ДокументОснование)=Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств")
		И ЗначениеЗаполнено(НоваяСтрока.ДокументОснование) Тогда
		НоваяСтрока.Подразделение = НоваяСтрока.ДокументОснование.Подразделение;
		НоваяСтрока.СтатьяДвиженияДенежныхСредств = НоваяСтрока.ДокументОснование.СтатьяДвиженияДенежныхСредств;
	КонецЕсли; 
	
	НоваяСтрока.ВидОплаты = ВидОплаты;
	НоваяСтрока.ПланФакт = ПланФакт;
	
	НоваяСтрока.Сумма = Объект.СуммаДокумента;
	Если МетаданныеОбъекта.Реквизиты.Найти("ВалютаДокумента")<>Неопределено Тогда
		Если ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
			НоваяСтрока.Сумма = РаботаСКурсамиВалют.ПересчитатьВВалюту(НоваяСтрока.Сумма,Объект.ВалютаДокумента,Константы.ВалютаРегламентированногоУчета.Получить(),Объект.Дата);
		КонецЕсли;	                                                             
	ИначеЕсли МетаданныеОбъекта.Реквизиты.Найти("Валюта")<>Неопределено Тогда
		Если ЗначениеЗаполнено(Объект.Валюта) Тогда
			НоваяСтрока.Сумма = РаботаСКурсамиВалют.ПересчитатьВВалюту(НоваяСтрока.Сумма,Объект.Валюта,Константы.ВалютаРегламентированногоУчета.Получить(),Объект.Дата);
		КонецЕсли;	
	КонецЕсли;

		
	Если ЭтоРасход Тогда
		//++ Бахтишаев А.Э. , 13/10/16 10:48, 311
		НоваяСтрока.НаправлениеДДС	= Перечисления.НаправленияДвиженийДенежныхСредств.Расход;
		//-- Бахтишаев А.Э. , 13/10/16 10:48
		НоваяСтрока.СуммаРасход = НоваяСтрока.Сумма;
	Иначе
		//++ Бахтишаев А.Э. , 13/10/16 10:48, 311
		НоваяСтрока.НаправлениеДДС	= Перечисления.НаправленияДвиженийДенежныхСредств.Приход;
		//-- Бахтишаев А.Э. , 13/10/16 10:48
		НоваяСтрока.СуммаПриход = НоваяСтрока.Сумма;
	КонецЕсли;
	
	Если Сторнировать Тогда
		НоваяСтрока.СуммаРасход = -НоваяСтрока.СуммаРасход;
		НоваяСтрока.СуммаПриход = -НоваяСтрока.СуммаПриход;
		НоваяСтрока.Сумма 		= -НоваяСтрока.Сумма;
	КонецЕсли; 
	
	Записывать = Истина;
	
КонецПроцедуры

Процедура ВыполнитьДвижение(Объект) Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	
	ВидОплаты = Перечисления.ВидыДенежныхСредств.Безналичные;
	Если ТипОбъекта=Тип("ДокументОбъект.РасходныйКассовыйОрдер")
		ИЛИ ТипОбъекта=Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		ВидОплаты = Перечисления.ВидыДенежныхСредств.Наличные;
	КонецЕсли; 
	
	ЭтоРасход = Ложь;
	Сторнировать = Ложь;
	БратьИзЗаявки = Ложь;
	
	Если ТипОбъекта=Тип("ДокументОбъект.ПриходныйКассовыйОрдер")
		ИЛИ ТипОбъекта=Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда
		Если Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПодотчетником 
			ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПКО.ВозвратДенежныхСредствПоставщиком 
			ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ВозвратДенежныхСредствПоставщиком  тогда
			ЭтоРасход = Истина;
			Сторнировать = Истина;
		КонецЕсли;
	ИначеЕсли ТипОбъекта=Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") Тогда
		ЭтоРасход = Истина;
	ИначеЕсли ТипОбъекта=Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
		БратьИзЗаявки = Истина;
		ЭтоРасход = Истина;
	КонецЕсли; 
	
	ВыполнитьДвижениеОбщая(Объект, ВидОплаты, ЭтоРасход, Сторнировать, Ложь, БратьИзЗаявки);
	
КонецПроцедуры
